# Frequency table

In [34]:
import pandas as pd

In [35]:
url = r"C:\\Users\\Acer\\Code\\TLU\\XSTK_TK\\Du_lieu\\"
cart_wheel = pd.read_csv(url + "Cartwheeldata.csv")

In [36]:
cart_wheel.head() # hien thi mot so quan sat dau

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.0,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.0,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.0,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4

In [37]:
cart_wheel.columns

TypeError: 'Index' object is not callable

In [ ]:
cart_wheel.shape

(25, 12)

In [ ]:
cart_wheel.loc[0:5, "Age"]

0    56
1    26
2    33
3    39
4    27
5    24
Name: Age, dtype: int64

In [ ]:
cart_wheel.loc[10,:]

ID                 11
Age                30
Gender              M
GenderGroup         2
Glasses             Y
GlassesGroup        1
Height           69.5
Wingspan         66.0
CWDistance         96
Complete            Y
CompleteGroup       1
Score               6
Name: 10, dtype: object

In [ ]:
cart_wheel.index

RangeIndex(start=0, stop=25, step=1)

In [ ]:
cart_wheel.iloc[:,2]

0     F
1     F
2     F
3     F
4     M
5     M
6     M
7     F
8     M
9     F
10    M
11    F
12    F
13    F
14    M
15    M
16    F
17    M
18    M
19    F
20    M
21    M
22    M
23    M
24    F
Name: Gender, dtype: object

In [ ]:
cart_wheel.Gender.unique()

array(['F', 'M'], dtype=object)

In [ ]:
cart_wheel.Age.unique()

array([56, 26, 33, 39, 27, 24, 28, 22, 29, 30, 25, 23, 31], dtype=int64)

# Lập bảng tần số cho một biến
- biến định tính
- biến định lượng: khi số quan sát lớn ta tiến hành phân tổ dữ liệu (phân nhóm)

In [ ]:
cart_wheel.sum()

ID                                     325
Age                                    706
Gender           FFFFMMMFMFMFFFMMFMMFMMMMF
GenderGroup                             38
Glasses          YYYNNNNNYYYYYNYYNNYYYNNNY
GlassesGroup                            14
Height                             1691.25
Wingspan                            1656.5
CWDistance                            2062
Complete         YYYYNNYYNYYYYYYYNYYYNYYYN
CompleteGroup                           19
Score                                  160
dtype: object

In [ ]:
cart_wheel.Gender.count()

25

1. lập bảng tần số cho cột giới tính

In [ ]:
tan_so = cart_wheel.Gender.value_counts()
tan_so

M    13
F    12
Name: Gender, dtype: int64

In [ ]:
tan_suat = tan_so/tan_so.sum()
tan_suat

M    0.52
F    0.48
Name: Gender, dtype: float64

In [ ]:
#Tính tỷ lệ
fre = cart_wheel.groupby(["Gender", "GenderGroup"]).size()
fre/sum(fre)
sum(fre)
fre.sum()
fre/fre.sum()

Gender  GenderGroup
F       1              0.48
M       2              0.52
dtype: float64

In [ ]:
cart_wheel.groupby(["Gender", "Complete"]).size()

Gender  Complete
F       N            2
        Y           10
M       N            4
        Y            9
dtype: int64

2. Lập bảng tần số chéo (cross table) cho 2 biến định tính: Gender và Complete

In [ ]:
pd.crosstab(cart_wheel["Gender"], cart_wheel["Complete"])
pd.crosstab(cart_wheel.Gender, cart_wheel.Complete)

Complete  N   Y
Gender
F         2  10
M         4   9

In [ ]:
x = pd.crosstab(cart_wheel.Gender, cart_wheel.Complete)
print(x/x.sum())
x.sum()

Complete         N         Y
Gender
F         0.333333  0.526316
M         0.666667  0.473684

Complete
N     6
Y    19
dtype: int64

In [ ]:
?pd.crosstab

Signature:
pd.crosstab(
    index,
    columns,
    values=None,
    rownames=None,
    colnames=None,
    aggfunc=None,
    margins: 'bool' = False,
    margins_name: 'str' = 'All',
    dropna: 'bool' = True,
    normalize=False,
) -> 'DataFrame'
Docstring:
Compute a simple cross tabulation of two (or more) factors.

By default, computes a frequency table of the factors unless an
array of values and an aggregation function are passed.

Parameters
----------
index : array-like, Series, or list of arrays/Series
    Values to group by in the rows.
columns : array-like, Series, or list of arrays/Series
    Values to group by in the columns.
values : array-like, optional
    Array of values to aggregate according to the factors.
    Requires `aggfunc` be specified.
rownames : sequence, default None
    If passed, must match number of row arrays passed.
colnames : sequence, default None
    If passed, must match number of column arrays passed.
aggfunc : function, optional
    If specified, requires `values` be specified as well.
margins : bool, default False
    Add row/column margins (subtotals).
margins_name : str, default 'All'
    Name of the row/column that will contain the totals
    when margins is True.
dropna : bool, default True
    Do not include columns whose entries are all NaN.
normalize : bool, {'all', 'index', 'columns'}, or {0,1}, default False
    Normalize by dividing all values by the sum of values.

    - If passed 'all' or `True`, will normalize over all values.
    - If passed 'index' will normalize over each row.
    - If passed 'columns' will normalize over each column.
    - If margins is `True`, will also normalize margin values.

Returns
-------
DataFrame
    Cross tabulation of the data.

See Also
--------
DataFrame.pivot : Reshape data based on column values.
pivot_table : Create a pivot table as a DataFrame.

Notes
-----
Any Series passed will have their name attributes used unless row or column
names for the cross-tabulation are specified.

Any input passed containing Categorical data will have **all** of its
categories included in the cross-tabulation, even if the actual data does
not contain any instances of a particular category.

In the event that there aren't overlapping indexes an empty DataFrame will
be returned.

Reference :ref:`the user guide <reshaping.crosstabulations>` for more examples.

Examples
--------
>>> a = np.array(["foo", "foo", "foo", "foo", "bar", "bar",
...               "bar", "bar", "foo", "foo", "foo"], dtype=object)
>>> b = np.array(["one", "one", "one", "two", "one", "one",
...               "one", "two", "two", "two", "one"], dtype=object)
>>> c = np.array(["dull", "dull", "shiny", "dull", "dull", "shiny",
...               "shiny", "dull", "shiny", "shiny", "shiny"],
...              dtype=object)
>>> pd.crosstab(a, [b, c], rownames=['a'], colnames=['b', 'c'])
b   one        two
c   dull shiny dull shiny
a
bar    1     2    1     0
foo    2     2    1     2

Here 'c' and 'f' are not represented in the data and will not be
shown in the output because dropna is True by default. Set
dropna=False to preserve categories with no data.

>>> foo = pd.Categorical(['a', 'b'], categories=['a', 'b', 'c'])
>>> bar = pd.Categorical(['d', 'e'], categories=['d', 'e', 'f'])
>>> pd.crosstab(foo, bar)
col_0  d  e
row_0
a      1  0
b      0  1
>>> pd.crosstab(foo, bar, dropna=False)
col_0  d  e  f
row_0
a      1  0  0
b      0  1  0
c      0  0  0
File:      c:\users\acer\appdata\local\programs\python\python311\lib\site-packages\pandas\core\reshape\pivot.py
Type:      function

In [ ]:
3. Tính tỷ lệ không hoàn thành trong nam và trong nữ

SyntaxError: invalid syntax (<ipython-input-33-8cd05758d7d9>, line 1)

In [ ]:
pd.crosstab(cart_wheel.Gender, cart_wheel.Complete, margins = True)

Complete  N   Y  All
Gender
F         2  10   12
M         4   9   13
All       6  19   25

In [ ]:
#Tính tỷ lệ theo dòng
x = pd.crosstab(cart_wheel.Gender, cart_wheel.Complete, margins=True)
x.N/x.All

Gender
F      0.166667
M      0.307692
All    0.240000
dtype: float64

In [ ]:
x.Y/x.All

Gender
F      0.833333
M      0.692308
All    0.760000
dtype: float64

In [ ]:
x.loc['F']

Complete
N       2
Y      10
All    12
Name: F, dtype: int64

In [ ]:
x.loc['All']

Complete
N       6
Y      19
All    25
Name: All, dtype: int64

In [ ]:
x.loc['F']/x.loc['All']

Complete
N      0.333333
Y      0.526316
All    0.480000
dtype: float64

In [ ]:
#Lap bang tan so cho cot Score
cart_wheel.Score.unique()

array([ 7,  8, 10,  4,  3,  9,  5,  6,  2], dtype=int64)

In [ ]:
cart_wheel.Score.value_counts()

10    4
8     4
6     3
5     3
4     3
3     3
9     2
7     2
2     1
Name: Score, dtype: int64

## 4. Phân tổ dữ liệu cột Score
Các bước phân tổ dữ liệu
- Xác định giá trị nhỏ nhất, lớn nhất
- Xác định số tổ (thường 5--15 tổ)
- Xác định khoảng cách tổ
- Tiến hành phân từng dữ liệu vào các tổ
### Chú ý: kiểm tra các điều kiện phân tổ (không thừa/thiếu dữ liệu): tổ đầu chứa min, tổ cuối chứa max

?pd.cut

In [ ]:
cart_wheel.Score.min()

2

In [ ]:
cart_wheel.Score.max()

10

In [ ]:
pd.cut(cart_wheel.Score, bins = 4).value_counts() #chia làm 4 tổ

(1.992, 4.0]    7
(8.0, 10.0]     6
(6.0, 8.0]      6
(4.0, 6.0]      6
Name: Score, dtype: int64

In [ ]:
pd.cut(cart_wheel.Score, bins = 4)

0       (6.0, 8.0]
1       (6.0, 8.0]
2       (6.0, 8.0]
3      (8.0, 10.0]
4     (1.992, 4.0]
5     (1.992, 4.0]
6      (8.0, 10.0]
7      (8.0, 10.0]
8       (4.0, 6.0]
9       (6.0, 8.0]
10      (4.0, 6.0]
11     (8.0, 10.0]
12      (4.0, 6.0]
13    (1.992, 4.0]
14     (8.0, 10.0]
15      (4.0, 6.0]
16     (8.0, 10.0]
17      (4.0, 6.0]
18    (1.992, 4.0]
19      (6.0, 8.0]
20    (1.992, 4.0]
21      (6.0, 8.0]
22    (1.992, 4.0]
23      (4.0, 6.0]
24    (1.992, 4.0]
Name: Score, dtype: category
Categories (4, interval[float64]): [(1.992, 4.0] < (4.0, 6.0] < (6.0, 8.0] < (8.0, 10.0]]

In [ ]:
pd.cut(cart_wheel.Score, bins = [2, 4, 6, 8, 10])

0      (6.0, 8.0]
1      (6.0, 8.0]
2      (6.0, 8.0]
3     (8.0, 10.0]
4      (2.0, 4.0]
5      (2.0, 4.0]
6     (8.0, 10.0]
7     (8.0, 10.0]
8      (4.0, 6.0]
9      (6.0, 8.0]
10     (4.0, 6.0]
11    (8.0, 10.0]
12     (4.0, 6.0]
13     (2.0, 4.0]
14    (8.0, 10.0]
15     (4.0, 6.0]
16    (8.0, 10.0]
17     (4.0, 6.0]
18     (2.0, 4.0]
19     (6.0, 8.0]
20            NaN
21     (6.0, 8.0]
22     (2.0, 4.0]
23     (4.0, 6.0]
24     (2.0, 4.0]
Name: Score, dtype: category
Categories (4, interval[int64]): [(2, 4] < (4, 6] < (6, 8] < (8, 10]]

In [ ]:
pd.cut(cart_wheel.Score, bins = [2, 4, 6, 8, 10]).value_counts()
#--> To dau thieu 2!!

(8, 10]    6
(6, 8]     6
(4, 6]     6
(2, 4]     6
Name: Score, dtype: int64

In [ ]:
pd.cut(cart_wheel.Score, bins = [2, 4, 6, 8, 10], include_lowest=True).value_counts() # them include_lowest=True

(1.999, 4.0]    7
(8.0, 10.0]     6
(6.0, 8.0]      6
(4.0, 6.0]      6
Name: Score, dtype: int64

# Bài 6

In [ ]:
data = pd.read_csv('./HocSinh.csv')

In [ ]:
data

     Unnamed: 0 GioiTinh  Lop  Tuoi      NoiO  HocLuc  TheThao  HinhThuc
0             1      Nam    5    11    NgoaiO       1        2         4
1             2      Nam    5    10    NgoaiO       2        1         4
2             3       Nu    5    11    NgoaiO       4        3         1
3             4       Nu    5    11    NgoaiO       2        3         4
4             5       Nu    5    10    NgoaiO       4        2         1
..          ...      ...  ...   ...       ...     ...      ...       ...
470         471      Nam    6    11  NoiThanh       4        1         2
471         472      Nam    6    11  NoiThanh       4        1         2
472         473      Nam    6    11  NoiThanh       4        2         1
473         474      Nam    6    11  NoiThanh       4        1         3
474         475      Nam    6    11  NoiThanh       4        1         2

[475 rows x 8 columns]

### a. Cho biết dữ liệu trong từng cột được đo bằng thang đo nào?
- Thang đo định tính
-- Thang đo định danh (nominal): chỉ phân loại, không có thứ tự
-- Thang đo thứ bậc (ordinal): so sánh được
- Thang đo định lượng
-- rời rạc
-- liên tục
Định tính: GioiTinh, NoiO (định danh)
Định lượng: Lop, Tuoi, HocLuc, TheThao, HinhThuc (rời rạc)

In [ ]:
data.dtypes

Unnamed: 0     int64
GioiTinh      object
Lop            int64
Tuoi           int64
NoiO          object
HocLuc         int64
TheThao        int64
HinhThuc       int64
dtype: object

### b. Cho biết tập dữ liệu này có bao nhiêu cột, bao nhiêu dòng?

In [ ]:
print('Rowns in data:', data.shape[0])
print('Columns in data:', data.shape[1])

Rowns in data: 475
Columns in data: 8

### c. Lấy ra dữ liệu ở cột thứ 3 (Tuoi).

In [ ]:
data['Tuoi']

0      11
1      10
2      11
3      11
4      10
       ..
470    11
471    11
472    11
473    11
474    11
Name: Tuoi, Length: 475, dtype: int64

### d. Lấy ra toàn bộ dữ liệu ở dòng thứ 10.

In [ ]:
data.iloc[[9]]

   Unnamed: 0 GioiTinh  Lop  Tuoi    NoiO  HocLuc  TheThao  HinhThuc
9          10       Nu    5    10  NgoaiO       4        3         2

In [ ]:
data.iloc[9, :]

Unnamed: 0        10
GioiTinh          Nu
Lop                5
Tuoi              10
NoiO          NgoaiO
HocLuc             4
TheThao            3
HinhThuc           2
Name: 9, dtype: object

### e. Tính số học sinh nữ, nam.

In [ ]:
data['GioiTinh'].value_counts().to_frame()

     GioiTinh
Nu        248
Nam       227

### f. Tính tỷ lệ học sinh có mức độ yêu thích thể thao là 4. Tính tỷ lệ này trong nhóm học sinh nam, trong nhóm học sinh nữ.

In [ ]:
tile = len(data[data['TheThao'] == 4])/len(data['TheThao'])
print('Tỉ lệ học sinh có mức độ yêu thích thể thao là 4:', tile)

Tỉ lệ học sinh có mức độ yêu thích thể thao là 4: 0.0968421052631579

In [ ]:
tmp_nam = len(data[data['GioiTinh'] == 'Nam'])
tmp_nu= len(data[data['GioiTinh'] == 'Nu'])

hs_nam = len(data[(data['TheThao'] == 4) & (data['GioiTinh'] == 'Nam')])
hs_nu = len(data[(data['TheThao'] == 4) & (data['GioiTinh'] == 'Nu')])

print('Tỉ lệ học sinh có mức độ yêu thích thể thao là 4 là nam:', hs_nam/tmp_nam)
print('Tỉ lệ học sinh có mức độ yêu thích thể thao là 4 là nữ:', hs_nu/tmp_nu)

Tỉ lệ học sinh có mức độ yêu thích thể thao là 4 là nam: 0.039647577092511016
Tỉ lệ học sinh có mức độ yêu thích thể thao là 4 là nữ: 0.14919354838709678

In [ ]:
pd.crosstab(data.GioiTinh, data.TheThao)

TheThao     1   2   3   4
GioiTinh
Nam       127  60  31   9
Nu         38  93  80  37

In [ ]:
ts = pd.crosstab(data.GioiTinh, data.TheThao, margins=True)
ts

TheThao     1    2    3   4  All
GioiTinh
Nam       127   60   31   9  227
Nu         38   93   80  37  248
All       165  153  111  46  475

In [ ]:
ts.iloc[0,3]/ts.iloc[0,4]

0.039647577092511016

In [ ]:
!pip install pandas

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
cd D:\XSTK-MA239\K2N2\Du_lieu # cd change directory

[WinError 2] The system cannot find the file specified: 'D:\\XSTK-MA239\\K2N2\\Du_lieu # cd change directory'
D:\XSTK-MA239\K2N2

In [ ]:
pwd # print working directory

'D:\\XSTK-MA239\\K2N2'

In [ ]:
cd ./Du_lieu

D:\XSTK-MA239\K2N2\Du_lieu

In [ ]:
import pandas as pd

In [ ]:
# Doc file.csv 
df = pd.read_csv("Cartwheeldata.csv")

In [ ]:
df.head()

,ID,Age,Gender,GenderGroup,Glasses,GlassesGroup,Height,Wingspan,CWDistance,Complete,CompleteGroup,Score
0,1,56,F,1,Y,1,62.0,61.0,79,Y,1,7
1,2,26,F,1,Y,1,62.0,60.0,70,Y,1,8
2,3,33,F,1,Y,1,66.0,64.0,85,Y,1,7
3,4,39,F,1,N,0,64.0,63.0,87,Y,1,10
4,5,27,M,2,N,0,73.0,75.0,72,N,0,4

In [ ]:
df.columns

Index(['ID', 'Age', 'Gender', 'GenderGroup', 'Glasses', 'GlassesGroup',
       'Height', 'Wingspan', 'CWDistance', 'Complete', 'CompleteGroup',
       'Score'],
      dtype='object')

In [ ]:
df.shape

(25, 12)